{
  "title": "Battles",
  "sections": [
    {
      "title": "Setup",
      "content": ""
    },
    {
      "title": "Deployment Zones",
      "content": ""
    },
    {
      "title": "Generate Mission Rules",
      "content": "Generate Mission Rules <br>With the battlefield and deployment zones established, it's time to determine what your warbands are <br>fighting over. This stage defines the heart of the scenario—what must be claimed, protected, or destroyed to <br>achieve victory. <br>The first part of this process is placing Objective Markers. <br>Place Objective Markers <br>Objective markers represent relics, control points, corrupted growths, or sites of tactical value. These can <br>influence the flow of battle dramatically, creating focal points that demand attention and draw blood. <br>To determine how many objective markers are placed and where they are located, roll 1D6 and consult the <br>Objective Marker Table. This roll determines the type and layout of objectives for the scenario. Some <br>results may create a single focal point; others may scatter multiple smaller objectives across the board. <br>This method ensures that each game feels different, with terrain, deployment, and objectives combining in <br>unique ways to shape the strategies both players will need to adopt. <br>1.  <br> <br>Waning Path <br>2.  <br> <br>Broken Front <br>3.  <br>Staggered Tide <br>4.  <br> <br>Twilight Cross <br>5.  <br> <br>Void Compass <br>6.  <br> <br>Rifted Veil <br>Primary Objective <br> <br>Secondary Objective <br>Once you have your result, place the objective markers as described—usually at set distances from the center <br>or corners of the board. Be sure to place them before any models are deployed. <br>After objective markers are placed, players can then determine the mission's Primary Objective and any <br>Secondary Objectives that will be in play. These objectives define how players earn points or claim victory <br>and are influenced by the positioning of the markers already on the board.<br> <br>37"
    },
    {
      "title": "Mission Rules",
      "content": ""
    },
    {
      "title": "Contesting & Controlling Objectives",
      "content": ""
    },
    {
      "title": "Mission List",
      "content": ""
    }
  ]
} 