{
  "title": "Core Rules",
  "sections": [
    {
      "title": "Core Concepts",
      "content": "Before learning the flow of a turn, it helps to understand a few key principles that apply throughout the game. These are the foundations of how models interact, measure, and resolve actions in Veilrot.",
      "sections": [
        {
          "title": "Rolling Dice",
          "content": "All checks in the game use standard six-sided dice (D6). When a rule says to roll, it usually means: roll one or more dice and compare each result to a target number (like \"4+,\" meaning you need a 4 or higher to succeed).<br><br>Sometimes you'll see the term <em>natural roll</em>. This means the number showing on the die before any modifiers are added.<br><br><ul><li>A natural 1 always fails, even if you have bonuses.</li><li>A natural 6 always succeeds, no matter the odds.</li><li>Modifiers (like +1 to Hit) are added to the roll after the roll is made.</li></ul>"
        },
        {
          "title": "Line of Sight",
          "content": "To see if a model can target something—like for a ranged attack or ability—you check line of sight. That simply means: can the model see the target?<br><br>You can measure this from any point on the model's body or its base. If any part of the target is visible from that perspective (even just an arm or weapon), line of sight is clear. Obstructions like walls or terrain might block it."
        },
        {
          "title": "Measuring Distance",
          "content": "All distances—movement, range, abilities—are measured from the edge of one model's base to another. Always base to base."
        },
        {
          "title": "Rounding & Fractals",
          "content": "In Veilrot, you'll never need fractions or decimals. All measurements, calculations, and effects are handled in whole numbers.<br><br>If a rule or effect results in a partial number—like 2.5 Wounds or 3.3 inches—always round up to the nearest whole number, unless a rule specifically says otherwise.<br><br><blockquote><strong>Example:</strong> A model falls 2.3 inches. That becomes 3\" for the purpose of fall damage. Another ability inflicts 1.5 Wounds—this becomes 2.</blockquote>"
        },
        {
          "title": "Engagement Range",
          "content": "A model is engaged when it's within 1\" of an enemy. Engagement matters because:<br><br><ul><li>You can't Move, Dash, or Charge while engaged.</li><li>You can't make Ranged Attacks or use Special Actions unless a rule says you can.</li><li>You can still make Melee Attacks, or try to Disengage.</li></ul><br>Once you understand these basics, the rest of the game flows much more easily. Keep them in mind—they come up often."
        },
        {
          "title": "Contesting & Controlling Objectives",
          "content": "Objectives represent key locations on the battlefield—sites of strategic or symbolic value. A figure's ability to influence and control these areas is determined by its Claim (C) value.<br><br><strong>Contesting an Objective</strong><br>A model is said to contest an objective if it is within 1\" of the objective marker.<br>Multiple models, including those from different players, can contest the same objective.<br>Contesting does not determine control, but may be required by certain mission actions, such as binding or delivering offerings.<br><br><strong>Controlling an Objective</strong><br>An objective is controlled by the player who has the highest total Claim value from friendly models within 3\" of the marker.<br>If two or more players have an equal amount of Claim within 3\", no one controls the objective."
        }
      ]
    },
    {
      "title": "Turn Sequence",
      "content": "Veilrot is played in alternating activations, which means players take turns activating one figure at a time instead of controlling their entire warband in one go. This system keeps the gameplay dynamic and interactive, forcing players to respond to evolving battlefield conditions.<br><br>Each game round is divided into three distinct phases:",
      "sections": [
        {
          "title": "Initiative Phase",
          "content": "At the start of each round, both players count the number of models in their warband currently on the battlefield. Then, each rolls a D6. The player with the highest result wins the initiative and chooses whether to activate a figure first or allow their opponent to do so. This choice can be critical—sometimes it's better to wait and react, while other times seizing the initiative can swing the tide of battle."
        },
        {
          "title": "Action Phase",
          "content": "Players then take turns activating their figures one at a time. When a figure activates, it can perform up to two actions, such as moving, attacking, or using a special ability. Figures cannot perform the same action twice in a single activation unless specifically allowed by a rule. Once a figure has completed its activation, it cannot act again that round. This continues until all figures from both sides have activated.<br><br>This alternating system encourages tactical foresight—players must weigh the risks of leaving figures vulnerable versus capitalizing on opportunities as they arise."
        },
        {
          "title": "End Phase",
          "content": "After all figures have activated, the End Phase begins. During this phase, players resolve any lingering effects such as ongoing conditions, scenario triggers, or end-of-round objective scoring. It's also a moment to assess the battlefield and prepare for the next round of conflict."
        }
      ]
    },
    {
      "title": "Figure Activation",
      "content": "When a figure activates, it may perform up to two actions. These actions represent everything from careful positioning to brutal combat or strategic ability use. Unless a rule specifically says otherwise, a figure cannot perform the same action twice in a single activation.<br><br>Here are the most common actions a figure can take:",
      "sections": [
        {
          "title": "Move",
          "content": "The figure travels up to its Movement (M) value in inches across the battlefield. This action is often used to reposition, advance toward objectives, or retreat from threats. Movement is affected by terrain and elevation as described in the Movement rules.<br><br>A figure cannot end a Move action within 1\" of an enemy model.<br>A figure also cannot perform a Move action while within engagement range of an enemy model."
        },
        {
          "title": "Dash",
          "content": "The figure surges forward in a desperate sprint. Roll a D6 and add the result to the figure's Movement value for this action. However, a figure that Dashes cannot Attack or Charge in the same activation. Dash is ideal for repositioning, escaping danger, or reaching objectives.<br><br>A figure cannot Dash while within engagement range of an enemy model."
        },
        {
          "title": "Charge",
          "content": "Charging is the bold act of hurling a figure into close combat, often turning the tide of battle with momentum and force. To declare a charge, first select one or more enemy models within line of sight as your target. Then roll 1D6 and add the result to your figure's Movement (M) value—this total is your charge distance.<br><br>If the target is within that distance to the target, move the charging figure toward them, placing it into engagement range (1\"). Because of the momentum and aggression behind the charge, the attacker gains +1 to Hit on any subsequent attacks this activation.<br><br>If the distance rolled isn't enough to reach the target, the charge fails—the figure remains in place and the action is wasted.<br><br>Some weapons and abilities gain bonuses when charging, so always check your figure's traits and gear. A well-timed charge can overwhelm defenses and seize control of contested ground—just be sure the distance isn't too great, or your warriors may fall short and exposed.<br><br>Note: A charging figure may not end its movement within engagement range of any enemy model other than its declared targets, following the same restrictions as normal movement."
        },
        {
          "title": "Attack",
          "content": "The figure makes a melee or ranged attack with one of its equipped weapons. Melee attacks require the target to be within engagement range, while ranged attacks must respect line of sight and range bands. Each attack follows the core Hit → Save → Damage → Grit sequence, as described in the combat rules.<br><br>A figure cannot make a ranged Attack while within engagement range of an enemy model."
        },
        {
          "title": "Retaliate",
          "content": "<em>\"It waits for the blow—and answers with its own.\"</em><br><br>This model may spend one action during its activation to enter a retaliatory stance. When it does, place a Retaliate token next to it.<br><br>If the model is targeted by an attack and survives, you may remove the Retaliate token to make an immediate free attack back against the attacker (melee or ranged, as appropriate).<br><br>Only one Retaliate token may be active on a model at a time.<br><br>This effect can only trigger once per round, and is lost if the token is not used by the end of the round."
        },
        {
          "title": "Disengage",
          "content": "This action allows a figure to carefully withdraw from close combat. The model may move up to its full Movement value away from any enemy models it is engaged with, so long as this movement ends outside of engagement range of any enemy models.<br><br>A figure that performs a Disengage action cannot Move, Attack, Dash, Charge, or use a Special Action for the remainder of its activation."
        },
        {
          "title": "Stand Up",
          "content": "Any model that is Prone may use one of its actions to stand up. This removes the Prone condition. Standing up costs effort. Timing it well is key—do you risk standing while vulnerable, or wait for support to arrive?"
        },
        {
          "title": "Cover",
          "content": "The figure braces for incoming fire or hunkers behind the environment. This action may only be taken if the model is within 1\" of a terrain feature.<br><br>While under the effect of Cover, if the model is Obscured by that terrain feature when attacked, the attacker suffers an additional –1 to Hit. The effect lasts until the figure's next activation or until it moves.<br><br>A figure cannot take the Cover action while within engagement range of an enemy model."
        },
        {
          "title": "Special Action",
          "content": "Many figures have unique abilities, rituals, or technological tricks listed in their rules. These often take the form of Special Actions and can include anything from healing allies to manipulating objectives or terrain.<br><br>A figure cannot perform a Special action while within engagement range of an enemy model."
        },
        {
          "title": "Overreach",
          "content": "<em>\"The third step is never stable—but sometimes, it's necessary.\"</em><br><br>A model may attempt a third action during its activation. This is called an Overreach, and the action taken may be one the model has already performed this turn.<br><br>Roll 1D6. On a 3+, the action succeeds and resolves as normal.<br>On a 1–2, the Overreach fails and the activation ends immediately.<br><br>If it fails:<br><ul><li>The opponent chooses any model on the battlefield (friendly or enemy) that has not yet activated. That model must activate immediately.</li><li>After that activation, turns proceed as normal.</li></ul><br><br>The Overreaching model suffers the following penalties until the start of your next turn:<br><ul><li>Its Claim is reduced to 0</li><li>All attacks targeting it may reroll failed Hit rolls</li></ul><br><br>Understanding which combination of actions best suits a situation is the heart of Veilrot's tactical depth. Whether you push forward aggressively, hold your ground, or use battlefield manipulation, how you spend each activation defines your warband's success."
        }
      ]
    },
    {
      "title": "Movement & Terrain",
      "content": "Movement in Veilrot is measured in inches and is one of the most tactically important parts of the game. A figure's <strong>Movement (M)</strong> stat defines how far it may travel when performing a <strong>Move</strong> or <strong>Charge</strong> action.<br><br>Models move freely across open ground, but terrain and elevation introduce key restrictions and opportunities.<br><br>Figures cannot move through other models unless they have a special rule that allows it. Likewise, most models may not end their movement overlapping another base, on impassable terrain, or in mid-air.",
      "sections": [
        {
          "title": "Terrain Effects",
          "content": "<strong>Difficult terrain</strong>, such as rubble, thick fungus, or waterlogged ground, costs <strong>double movement</strong> to cross.<br><br>For example, moving 2 inches through difficult terrain would cost 4 inches of movement. Figures can still move out of or around such terrain if they have the remaining movement to do so.<br><br><strong>Vertical movement</strong>, such as climbing up walls or over obstacles, also costs <strong>double movement</strong>. Additionally, a model cannot move more than <strong>3 inches vertically</strong> in a single direction during a single activation, unless it has a rule or equipment that states otherwise.<br><br>A model may not end its movement while partway through vertical traversal; it must fully complete the vertical move or remain where it started.<br><br>This creates meaningful decision-making when traversing multi-level battlefields and rewards strategic use of terrain, ladders, and elevation rules. Some warbands or figures may possess special rules to ignore or reduce these movement penalties, making them especially mobile or evasive in ruined environments."
        },
        {
          "title": "Fall",
          "content": "<em>Sometimes a model ends up somewhere it didn't mean to be—knocked from a ledge, pulled by an ability, or simply misjudging a drop. In Veilrot, falling hurts.</em><br><br>Whenever a model falls from a height, it suffers <strong>1 point of damage</strong> for each full inch fallen, minus its <strong>Strength</strong> stat.<br><br>• Only full inches count—round down if needed<br>• This damage can't be blocked by <strong>Save</strong> rolls<br>• However, the model still rolls <strong>Grit</strong> checks as normal to try and resist the incoming harm<br><br><strong>Example:</strong> A model with <strong>Strength 3</strong> falls 5\". It takes 2 damage (5 – 3 = 2). It then rolls 2 <strong>Grit</strong> checks—one for each point of damage.<br><br>If the <strong>Strength</strong> value is equal to or greater than the fall distance, the model hits the ground hard but uninjured. You can imagine it rolling with the impact, digging into the terrain, or simply being built to survive worse.<br><br>A model taking damage in this way is also knocked <strong>Prone</strong>."
        },
        {
          "title": "Prone",
          "content": "A model that becomes <strong>Prone</strong> has been knocked off its feet, staggered to the ground, or otherwise thrown out of fighting stance. This condition limits the model's options severely until it recovers.<br><br><strong>While Prone:</strong><br><ul><li>The model can't perform any actions other than <strong>Stand Up</strong></li><li>It can still be targeted by attacks and abilities</li><li>It counts as <strong>Engaged</strong> if within 1\" of an enemy, but cannot make <strong>Melee Attacks</strong> until it recovers</li></ul><br>Being <strong>Prone</strong> represents loss of footing, momentary collapse, or being driven to the ground by force. It's dangerous to stay that way—especially near enemies."
        },
        {
          "title": "Collide",
          "content": "<em>Sometimes, a model is shoved, hurled, dragged, or launched—and ends up crashing into something else. In Veilrot, when a moving model involuntarily collides with another model, the result is often bruising, bone-snapping, or worse.</em><br><br>A <strong>collision</strong> occurs when a model is forced to move and ends its movement overlapping the base of another model. This can happen from knockback effects, pull abilities, terrain shifts, or being flung by explosions or relic effects.<br><br><strong>When a collision occurs:</strong><br>Both models suffers <strong>Wounds</strong> equal to:<br>[enemy model's <strong>Toughness</strong>] + [<strong>distance moved</strong>] – [its own <strong>Toughness</strong>]"
        }
      ]
    },
    {
      "title": "Combat",
      "content": "Combat in Veilrot is intense, personal, and layered. It's not just about who swings first or who wears thicker armor—it's about positioning, momentum, and the desperate edge between life and death.<br><br>Every time a model makes an attack, it unfolds in two linked stages: the <strong>Clash</strong>, where weapons meet resistance, and the <strong>Suffering</strong>, where consequences take root.<br><br>Understanding this sequence—what it tests, what it rewards—is key to mastering the battlefield.",
      "sections": [
        {
          "title": "Clash",
          "content": "<em>The moment of impact—when attacks are made and resisted.</em><br><br>This is the exchange of blows: the moment steel meets flesh, or thought meets entropy. In <strong>Clash</strong>, both attacker and defender engage in opposed rolls that determine if the attack lands and whether it can be turned aside. This phase includes to-hit rolls, saves, and any resulting triggers—such as critical strikes, flawless hits, or disastrous fumbles. It's fast, volatile, and often decisive.<br><br><strong>Roll to Hit:</strong><br>To begin, the attacker rolls a number of D6 equal to their weapon's <strong>Attack Dice</strong>. Each roll is compared to the attacker's <strong>Strike</strong> (for melee) or <strong>Aim</strong> (for ranged). If the modified result is equal to or greater than that stat, the die is a hit.<br><br>Modifiers (such as charging, terrain, or effects) are added to the roll itself, not to the target number.<br><br><strong>Example:</strong> If a model has <strong>Strike 4+</strong> and rolls a 3, but has a +1 bonus from charging, the final result is a 4—so it counts as a hit.<br><br><strong>Roll to Save:</strong><br>For each hit scored, the defender rolls one D6 and compares each result to their <strong>Save</strong> value, which is determined by the armor or shield they are using. A roll that meets or exceeds the <strong>Save</strong> value is a success.<br><br><strong>Save</strong> modifiers (such as from a weapon's profile) are also added to the roll, not subtracted from the <strong>Save</strong> value.<br><br><strong>Example:</strong> If a defender has <strong>Save 4+</strong> and the attacker's weapon has a –1 <strong>Save</strong> Modifier, the defender must roll a 5. But instead of changing the target number, you simply add –1 to the roll. So a rolled 5 becomes a 4—just enough to save."
        },
        {
          "title": "Suffering",
          "content": "<em>Now comes the cost—the pain inflicted, and the will to survive it.</em><br><br>Once an attack breaches defenses, <strong>Suffering</strong> determines the toll. Damage is calculated based on the attacker's <strong>Strength</strong> versus the defender's <strong>Toughness</strong>, then blunted—or not—by raw resolve. This phase reveals the aftermath: the wounds dealt, the <strong>Grit</strong> tested, and the line between survival and collapse.<br><br><strong>Apply Damage:</strong><br>If at least one save failed, the attack deals damage. The weapon's base <strong>Damage</strong> is listed on its profile, but this amount can be multiplied depending on how hard the blow landed.<br><br>First, for each unsaved hit, the attacker rolls one D6—this is a <strong>Damage Roll</strong>. Modifiers are applied to the roll result, based on how the attacker's <strong>Strength</strong> compares to the target's <strong>Toughness</strong>.<br><br><table class='table-auto w-full'><tr><th class='px-4 py-2 text-left'><strong>Strength</strong> vs <strong>Toughness</strong> Comparison</th><th class='px-4 py-2 text-left'>Modifier to <strong>Damage Roll</strong></th></tr><tr><td class='px-4 py-2'><strong>Strength</strong> is greater than <strong>Toughness</strong></td><td class='px-4 py-2'>+1</td></tr><tr><td class='px-4 py-2'><strong>Strength</strong> is at least double <strong>Toughness</strong></td><td class='px-4 py-2'>+2</td></tr><tr><td class='px-4 py-2'><strong>Strength</strong> is lower than <strong>Toughness</strong></td><td class='px-4 py-2'>–1</td></tr><tr><td class='px-4 py-2'><strong>Strength</strong> is half or less than <strong>Toughness</strong></td><td class='px-4 py-2'>–2</td></tr></table><br><br>Once the modifiers are applied, take the highest of all <strong>Damage Rolls</strong> from that attack. Only that result is used to determine how much damage is inflicted—representing the most punishing strike landing cleanly.<br><br>• On a 5+, the damage is doubled<br>• On a 7+, the damage is tripled<br><br><strong>Example:</strong> You roll 3 <strong>Damage Dice</strong> and get 4, 5, and 6. After modifiers, they become 5, 6, and 7. The 7+ triples the damage. If the weapon has <strong>Damage 2</strong>, the final result is 6 damage.<br><br><strong>Grit Check:</strong><br>Once the damage is set, the defender rolls a <strong>Grit Check</strong> for each point of damage taken. For each damage, roll one D6. If the result equals or exceeds the model's <strong>Grit</strong> value, that point of damage is negated.<br><br>This is the final layer of survival. <strong>Grit</strong> doesn't represent physical armor—it reflects willpower, resolve, mutation, or sheer refusal to fall.<br><br><strong>Example:</strong> A figure takes 4 damage and has <strong>Grit 5+</strong>. It rolls 4 dice: 5, 2, 6, 3. Two results are 5 or more, so only 2 damage is suffered."
        },
        {
          "title": "Damage from other sources",
          "content": "Even outside of attacks, figures may roll <strong>Grit</strong> checks against any source of damage—whether from abilities, terrain, or mission effects. For each point taken, roll one D6: results equal to or above the figure's <strong>Grit</strong> negate that damage. <strong>Grit</strong> always applies, reflecting raw endurance in any situation."
        },
        {
          "title": "Triggers",
          "content": "After rolling for either hit, save or grit, check for special triggers:<br><ul><li><strong>Critical:</strong> Any die that rolls a natural 6 is considered a Critical and may trigger abilities or effects.</li><li><strong>Flawless:</strong> All dice hit. Some weapons or abilities gain bonuses when this occurs.</li><li><strong>Fumble:</strong> All dice miss. This can trigger penalties or setbacks.</li></ul>These triggers represent either moments of uncanny precision or devastating failure, and often tie into a weapon's traits or a figure's special rules."
        },
        {
          "title": "Survivor's Surge",
          "content": "If a model rolls a <strong>Grit</strong> check with 3 or more dice, and all rolls succeed, it may immediately do one of the following:<br><ul style=\"display:inline-block; text-align:left; list-style-type:disc; margin:0 auto;\"><li>Make a free melee or ranged attack against the attacking model</li><li>Move up to 3\" (ignoring engagement range, but not terrain)</li></ul>This only triggers if the model survives the damage after the <strong>Grit</strong> check.<br>This free action does not cost an action and does not trigger other abilities (like charge bonuses)."
        },
        {
          "title": "Combat Example",
          "content": "<div style=\"text-align:center\"> <img src=\"images/combatexample01.png\" alt=\"Combat Example 1\" style=\"max-width:100%; display:block; margin: 0 auto 8px auto;\"><br>The <strong>Thornbound Choir Warrior</strong> declares a charge against the <strong>Bastion Concord Soldier</strong>.<br>The distance between them is 8\".<br>The Warrior has a <strong>Movement</strong> of 5\" and rolls a 4 for the charge.<br>With a total of 9\", the charge succeeds.<br>He moves into <strong>Engagement Range</strong> of his target.<br><br><img src=\"images/combatexample02.png\" alt=\"Combat Example 2\" style=\"max-width:100%; display:block; margin: 0 auto 8px auto;\"><br>As his second action he attacks with his <strong>Short Sword</strong> (4 dice):<br>With <strong>Strike 4+</strong>, he rolls and scores 3 hits—one of them a <strong>Critical</strong>.<br><br><img src=\"images/combatexample03.png\" alt=\"Combat Example 3\" style=\"max-width:100%; display:block; margin: 0 auto 8px auto;\"><br>Now it's the <strong>Bastion Concord's</strong> turn to make saves:<br>He rolls 3 dice—one for each hit from the attack.<br>His <strong>Heavy Leather</strong> gives a 4+ <strong>Save</strong> normally.<br>But the attack's <strong>Critical</strong> hit worsens it to a 5+.<br>He rolls the dice—only one is a success.<br><br><img src=\"images/combatexample04.png\" alt=\"Combat Example 4\" style=\"max-width:100%; display:block; margin: 0 auto 8px auto;\"><br>The <strong>Bastion Concord</strong> failed two saves.<br>The <strong>Thornbound Warrior</strong> now rolls for damage.<br><strong>Strength</strong> and <strong>Toughness</strong> are equal, so no modifier.<br>He rolls a 4 and a 5, and takes the highest result.<br>A 5 means double damage is dealt!<br>The <strong>Short Sword</strong> deals 1 damage—doubled to 2.<br><br><img src=\"images/combatexample05.png\" alt=\"Combat Example 5\" style=\"max-width:100%; display:block; margin: 0 auto 8px auto;\"><br>As a final step, the <strong>Bastion Concord</strong> makes <strong>Grit</strong> checks:<br>He rolls one die for each point of damage taken.<br>His <strong>Grit</strong> is 5+, so he needs 5 or higher to cancel.<br>He rolls a 1 and a 6—one success.<br>One point of damage is cancelled, one goes through.</div>"
        }
      ]
    },
    {
      "title": "Common Abilities",
      "content": "Combat in Veilrot is intense, personal, and layered. It's not just about who swings first or who wears thicker armor—it's about positioning, momentum, and the desperate edge between life and death.<br><br>Every time a model makes an attack, it unfolds in two linked stages: the <strong>Clash</strong>, where weapons meet resistance, and the <strong>Suffering</strong>, where consequences take root.<br><br>Understanding this sequence—what it tests, what it rewards—is key to mastering the battlefield.",
      "sections": [
        {
          "title": "Last Stand (X+)",
          "content": "<div data-ability='Last Stand'></div>"
        },
        {
          "title": "Guarded",
          "content": "<div data-ability='Guarded'></div>"
        },
        {
          "title": "Brutal Impact (X+)",
          "content": "<div data-ability='Brutal Impact'></div>"
        },
        {
          "title": "Bloodthirsty",
          "content": "<div data-ability='Bloodthirsty'></div>"
        },
        {
          "title": "Anchored",
          "content": "<div data-ability='Anchored'></div>"
        },
        {
          "title": "Honed Reflex",
          "content": "<div data-ability='Honed Reflex'></div>"
        },
        {
          "title": "Frenzied Rush",
          "content": "<div data-ability='Frenzied Rush'></div>"
        },
        {
          "title": "Iron Grasp",
          "content": "<div data-ability='Iron Grasp'></div>"
        }
      ]
    }
  ]
}

