{
  "title": "Description",
  "content": "Each weapon in Veilrot has a distinct battlefield role, represented by its stats and traits. The weapons table provides a quick overview of how each weapon functions, helping players equip their warbands with the right tools for their tactics. Here's how to read and understand each column:<br><br><strong>Name</strong><br>This is the name of the weapon—some are common, others rare or brutal. Similar types (like swords, axes, or guns) often share mechanical identities that shape how they feel in play.<br><br><strong>Hands</strong><br>This indicates how many hands are required to wield the weapon: 1 for a single-handed weapon, and 2 for a two-handed weapon. You can only equip one two-handed weapon at a time, and only one item in each hand.<br><br><strong>Range (Ranged weapons only)</strong><br>The maximum distance, in inches, the weapon can be used to attack. Weapons without a Range value are melee-only and can only be used when within engagement range (1\").<br><br><strong>Attack Dice</strong><br>The number of D6 rolled when making an attack with this weapon. Faster, lighter weapons roll more dice, increasing the chance to hit. Heavy or devastating weapons roll fewer dice but often hit harder.<br><br><strong>Strength Mod</strong><br>This value is added to the wielder's Strength stat when calculating how effective the attack is against the defender's Toughness. A higher Strength can make it easier to deal serious damage.<br><br><strong>Save Mod</strong><br>This value reduces the target's Save roll, making it harder for them to block the hit. A weapon with a –1 Save Mod is more likely to punch through armor. Some ranged weapons, like muskets, can reach –3 or more.<br><br><strong>Damage</strong><br>The base amount of damage the weapon deals if it successfully hits and the defender fails their Save roll. This number can be multiplied if the Damage Roll is high, depending on how strong and accurate the attack was.<br><br><strong>Traits</strong><br>Special rules or effects unique to the weapon. Some weapons deal extra damage on a Critical Hit, knock enemies prone, or ignore shield bonuses. Traits give weapons personality and strategic value—read them carefully!<br><br><strong>Cost</strong><br>The relative value of the weapon, used when building your warband. Cheaper weapons are plentiful and versatile; expensive ones are rare, powerful, or specialized.<br><br>Understanding a weapon's strengths and drawbacks is key to building an effective warband. Will you favor the consistent pressure of light blades, the raw devastation of great axes, or the brutal simplicity of flails? Every weapon tells a story. Equip wisely."
} 