{
  "title": "Introduction",
  "sections": [
    {
      "title": "Introduction",
      "content": "Veilrot is a dark skirmish miniatures game set in a world unraveling at the seams—reshaped by the irradiant remnants of a shattered moon. When that celestial body fractured, it bled something divine and ruinous into the soil.<br><br>Now, reality itself is in flux. Fungal intelligences bloom beneath the surface, faith burns in silver fire, and ancient technologies twitch back to life. Nothing is stable. Nothing is safe. Nothing is sacred.<br><br>Players command warbands—small, elite groups of warriors, zealots, constructs, or aberrations—each shaped by their beliefs, biology, and battle doctrine. Some seek to restore what was lost, others to profit from the collapse, and still others to accelerate the transformation of the world into something wholly alien.<br><br>Gameplay in Veilrot focuses on tactical decision-making, resourceful positioning, and risk-driven combat. Every choice—whether movement, attack, or objective play—can swing the course of a game. There are no large armies here, only small forces with outsized impact, fighting over relics, memories, and fragments of power.<br><br>Factions are distinct in both theme and mechanics, but all warbands operate within the same brutal framework of conflict. Combat is fast and unforgiving. Objectives matter. Momentum shifts quickly. And the battlefield is never neutral—it twists and reacts with its own ancient hungers.<br><br>This document introduces the core mechanics that define how Veilrot is played. It covers everything from turn structure and actions to combat, objectives, and mission creation. Whether you come to burn, bind, or break the world, the first step is understanding its rules."
    },
    {
      "title": "What You Need to Play",
      "content": "To play a game of Veilrot, each player will need to bring the tools of war, fate, and ruin. These essentials shape the battlefield and ensure smooth play:<br><br><ul><li><strong>A Warband:</strong> Each player commands a small group of unique miniatures, known as a warband. These may be custom-built or selected from pre-made rosters, and should include figure sheets, condition markers, and any relevant faction tokens or relic counters.</li><li><strong>Measuring Tools:</strong> Movement and range in Veilrot are measured in inches. A ruler or tape measure marked in inches is required for all gameplay.</li><li><strong>Six-sided Dice (D6):</strong> All rolls in Veilrot use standard six-sided dice. It's recommended that each player have a handful for attack rolls, saves, Grit checks, and other effects.</li><li><strong>Rulebook & Reference Sheets:</strong> Having the Veilrot Core Rules and faction-specific references on hand helps resolve abilities, conditions, and combat triggers without slowing the game.</li><li><strong>A Battlefield:</strong> Games of Veilrot are played on a richly textured battlefield, filled with ruins, fungal overgrowth, broken trenches, and unnatural terrain. The standard play area is 3 feet by 3 feet. Scenarios may adjust this size for narrative reasons. Objective markers—used to represent key control points or relics—should be included as part of the terrain setup.</li></ul><br>Creating an evocative battlefield enhances immersion and supports the game's focus on movement, line of sight, and area control."
    }
  ]
} 