{
  "title": "Player Objectives",
  "sections": [
    {
      "title": "How to Generate a Player Objective",
      "content": "How to Generate a Player Objective <br>1. After the mission is selected but before deployment, each player rolls 1D6: <br>○ On a 1–3, roll on Table A: Tactical Objectives. <br>○ On a 4–6, roll on Table B: Strike Objectives. <br>2. Then roll 1D6 again to determine your objective from the chosen table. <br>3. Keep the result secret until it is completed or revealed at the end of the game. <br>You may only complete one Player Objective per battle. Each one has its own listed Victory Point <br>reward."
    },
    {
      "title": "Table A: Tactical Objectives",
      "content": "Table A: Tactical Objectives <br>1. Line Breaker — 3 Victory Point <br> Control three different objectives in the same round. <br> Success requires timing and bold positioning to claim multiple zones at once. <br>2. Zone Denial — 3 Victory Points <br> Control three different objectives at the end of the game. <br> This long-term goal rewards strategic resilience and endgame control. <br>3. Sigil Claimant — 3 Victory Point <br> Perform the Claim Sigil action on an objective. This Player Objective can be achieved more than once, but <br>only once for each objective on the battlefield. <br> This action represents your warband marking an objective site for unknown purposes. <br>Claim Sigil (Action): While controlling an objective, a model may perform this action on an <br>objective they are contesting.  <br>4. Hold the Line — 3 Victory Point <br> At the end of the game, at least half of your starting models must remain alive on the battlefield. <br> Simple, but challenging in brutal scenarios. <br>5. Oppressive Advance — 3 Victory Point <br> At any point during the game, have at least one model contesting every Primary Objective. <br> You don't need to control them—just be within 1\". <br>6. Commanding Presence — 3 Victory Point <br> Have your Leader contest a controlled Primary Objective at the end of any round. <br> Assert dominance through leadership and placement. <br>50"
    },
    {
      "title": "Table B: Strike Objectives",
      "content": "Table B: Strike Objectives <br>1. Wipe the Blade — 3 Victory Point <br> Destroy four enemy figures during the game. <br> A steady and relentless approach to battlefield elimination. <br>2. Break the Chain — 3 Victory Points <br> Destroy the enemy Leader model. <br> High risk, high reward—requires precise execution or raw power. <br>3. Precision Execution — 3 Victory Points <br> Destroy two enemy figures while also scoring at least one critical hit. <br> You must deliver the killing blow in an attack that includes at least one 6 on the Hit roll. <br>4. First to Spill — 3 Victory Point <br> Be the first player to destroy an enemy figure. <br> If your opponent scores the first kill, this objective cannot be completed. <br>5. No Witnesses — 3 Victory Points <br> At the end of the game, no enemy figures may be within 6\" of your deployment zone. <br> Defend your territory and deny your opponent infiltration. <br>6. Strike and Fade — 3 Victory Points <br> In a single round, destroy an enemy figure and then move the attacker 5\" or more away from the site of the <br>kill. <br> Mobility and precision define this surgical goal. <br> <br>51 <br> <br>Narrative Layers (Optional) <br>Every battlefield in Veilrot tells a story. Some whisper in fungal breath, others scream with silver flame or <br>machine static. While the mission defines how victory is measured, the narrative layer defines what the battle <br>feels like—and what's truly at stake."
    }
  ]
} 