{
  "title": "Weapon Traits",
  "content": "<table class='table-auto w-full'><tr><th class='px-4 py-2 text-left'>Trait Name</th><th class='px-4 py-2 text-left'>Effect Description</th></tr><tr><td class='px-4 py-2'>Shatter</td><td class='px-4 py-2'>Targets do not benefit from shields when defending against this weapon.<br>- Ideal for disrupting defensive formations.</td></tr><tr><td class='px-4 py-2'>Flurry</td><td class='px-4 py-2'>For each Critical Hit, the target suffers 1 Wound.<br>- This represents a pinpoint strike—through eye socket, exposed joint, or corrupted heart—that ignores conventional defenses.</td></tr><tr><td class='px-4 py-2'>Piercing</td><td class='px-4 py-2'>For each Critical Hit, the target suffers –1 to their Save against that attack.<br>- Useful for piercing heavier armor with precision.</td></tr><tr><td class='px-4 py-2'>Crushing</td><td class='px-4 py-2'>If all Hit rolls succeed, the target is Knocked Prone.<br>- A display of unrelenting pressure or technique.</td></tr><tr><td class='px-4 py-2'>Impale</td><td class='px-4 py-2'>If this model charged before making the attack, it gains +1 Attack Dice.<br>- Rewards aggressive movement.</td></tr><tr><td class='px-4 py-2'>Blast</td><td class='px-4 py-2'>Also, resolve a full attack sequence against all other models within 2\" of that target, including friendly models. Each affected model is treated as if it were directly attacked.<br>- Blast weapons are powerful but risky in close quarters.</td></tr><tr><td class='px-4 py-2'>Cleave</td><td class='px-4 py-2'>On a Critical Hit, the attack deals 1 additional damage.<br>- A powerful strike that cuts deeper than expected.</td></tr><tr><td class='px-4 py-2'>Knockdown</td><td class='px-4 py-2'>On a Critical Hit, the target is knocked Prone.<br>- A forceful impact that sends the target sprawling.</td></tr><tr><td class='px-4 py-2'>Pierce</td><td class='px-4 py-2'>On a Critical Hit, the attack ignores the target's Save.<br>- A precise strike that finds its way through any defense.</td></tr><tr><td class='px-4 py-2'>Rend</td><td class='px-4 py-2'>On a Critical Hit, the target's Toughness is reduced by 1 for the rest of the game.<br>- A brutal wound that weakens the target's resilience.</td></tr><tr><td class='px-4 py-2'>Sweep</td><td class='px-4 py-2'>On a Critical Hit, the attack can target an additional enemy within 1\" of the original target.<br>- A wide swing that catches multiple opponents.</td></tr><tr><td class='px-4 py-2'>Vicious</td><td class='px-4 py-2'>On a Critical Hit, the attack deals 2 additional damage.<br>- A particularly brutal strike that causes severe wounds.</td></tr></table>"
} 