{
  "name": "Moonfall Covenant",
  "shortDescription": "The Moonfall Covenant are militant devotees of the broken moon's memory, wielding silver flame and sacred song to purge corruption. Clad in scorched relic-plate and marked by holy burns, they deliver both salvation and annihilation in equal measure. Their war is not for territory — it is for cleansing.",
  "description": "The Moonfall Covenant draws its power from the shattered remains of a fallen moon. Their warriors are marked by lunar scars that pulse with cold light, and they wield weapons forged from moon-metal that can cut through reality itself.",
  "equipment": [
    {
      "name": "Moon-Metal Blade",
      "description": "A weapon that can phase through solid matter."
    },
    {
      "name": "Lunar Armor",
      "description": "Armor that glows with cold moonlight and provides protection against void energies."
    },
    {
      "name": "Void Crystal",
      "description": "A focus for channeling lunar powers."
    }
  ],
  "branches": [
    {
      "name": "Order of the Lunar Blade",
      "description": "Specializes in moon-metal weaponry and combat techniques."
    },
    {
      "name": "Cult of the Void",
      "description": "Studies and harnesses the power of the void between stars."
    },
    {
      "name": "Lunar Seers",
      "description": "Mystics who interpret the patterns of the fallen moon."
    }
  ],
  "factionRules": [
    {
      "name": "Ashen Communion",
      "description": "At the start of a unit's activation, if there are at least two other friendly Moonfall Covenant units within 3\" of it, the unit becomes Illumed until the start of its next activation."
    },
    {
      "name": "Illumed (Condition)",
      "description": "This unit scores Critical Triggers on a roll of 5+."
    },
    {
      "name": "Moonseared (Condition)",
      "description": "An enemy unit with the Moonseared Condition is treated as a friendly Moonfall Covenant unit for the Ashen Communion Special Rule.<br>At the start of the turn, remove all Moonseared Conditions."
    }
  ]
} 