{
  "name": "Thornbound Choir",
  "shortDescription": "<i>The Thornbound Choir are a living congregation of sacred rot — symbiotic zealots who revere decay as divine and believe all things must fall to feed the cycle. They graft themselves with fungal growths, sprout weapons from flesh, and transform battlefields into blooming mausoleums. Death is not an ending, but a cultivation.</i>",
  "description": "<div class=\"faction-description\"><p class=\"italic\">In the depths of the Veilrot, where shadows dance with decay, the Thornbound Choir weaves its fungal liturgy. Their spores carry whispers of transformation, their chants echo through the hollow places, and their very presence brings the promise of rebirth through sacred rot.</p><br><p>To join the Choir is to embrace the cycle of decay and renewal. Each member becomes a vessel for the sacred spores, their bodies transformed into living gardens of fungal growth. Their minds expand, connected to the vast mycelial network that spreads beneath the land, sharing thoughts and visions across great distances.</p><br><p>The Choir's rituals are both beautiful and terrible to behold. They gather in circles, their bodies adorned with living fungi, their voices rising in harmonies that seem to come from beyond the mortal realm. As they chant, the air fills with spores that seek out the worthy, marking them for transformation.</p><br><p>Their sacred texts are written in patterns of fungal growth, their temples are living structures of mycelium and decay, and their weapons are crafted from the bones of the transformed. To face the Thornbound Choir is to face the inevitability of change, for they are the harbingers of the great cycle of death and rebirth.</p><br><p>In battle, they are both graceful and terrifying. Their movements are fluid, their attacks precise, and their very presence brings the promise of transformation. They do not seek to destroy, but to change, to bring all things into the embrace of the sacred rot.</p><br><p>As the Veilrot spreads, so too does the influence of the Thornbound Choir. Their fungal gardens grow, their numbers swell, and their vision of a world transformed by sacred decay becomes ever more real. They are the gardeners of the new world, tending to the cycle of death and rebirth that will bring about the final transformation.</p><br><p class=\"italic\">\"In decay, we find renewal. In death, we find life. In the sacred rot, we find the path to transcendence.\"</p></div>",
  "factionRules": [
    {
      "name": "Rot's Reach",
      "description": "<i>A soft eruption of rot and purpose, where the earth begins to remember what it once was.</i><br>Bloom Markers are placed on the battlefield by Thornbound Choir units through abilities, critical effects, or special actions.<br>Once placed, Bloom Markers remain on the field until removed or transformed by other effects. They may be interacted with by Thornbound units in various ways depending on unit abilities, including targeting, affecting range, triggering effects, or enabling additional actions.<br>Each Bloom Marker is considered a Marker for all gameplay purposes unless otherwise specified."
    },
    {
      "name": "Rot-Touched Air",
      "description": "<i>“The breath around them no longer belongs to them.”</i><br>Enemy units within 3\" of any Thornbound Choir model or Bloom Marker count all Flawless Grit checks as normal successes instead."
    }
  ],
  "equipment": [
    {
      "name": "Spore Launcher",
      "description": "A weapon that fires concentrated bursts of sacred spores, marking targets for transformation."
    },
    {
      "name": "Fungal Armor",
      "description": "Living armor that grows from the wearer's body, providing protection and spreading spores."
    }
  ],
  "branches": [
    {
      "name": "Gardeners of Decay",
      "description": "Specialists in the cultivation and spread of the sacred rot, transforming the land itself."
    },
    {
      "name": "Choir of Transformation",
      "description": "The spiritual heart of the faction, their rituals and chants guiding the process of change."
    }
  ]
} 